@ParthaI I updated the tests, they were broken. Below are the results. Please let me know if I should do something about the Json response in field cache_usage_limits having a casing mismatch with the rest of the keys names. 

<details>
  <summary>Logs</summary>

```
node tint.js tests/aws_elasticache_serverless_cache
No env file present for the current environment:  staging 
 Falling back to .env config
No env file present for the current environment:  staging
customEnv TURBOT_TEST_EXPECTED_TIMEOUT undefined

SETUP: tests/aws_elasticache_serverless_cache []

PRETEST: tests/aws_elasticache_serverless_cache

TEST: tests/aws_elasticache_serverless_cache
Running terraform
data.aws_region.primary: Reading...
data.aws_caller_identity.current: Reading...
data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_region.primary: Read complete after 0s [id=us-east-1]
data.aws_region.alternate: Reading...
data.aws_region.alternate: Read complete after 0s [id=us-east-2]
data.aws_caller_identity.current: Read complete after 0s [id=EDITED]
data.null_data_source.resource: Reading...
data.null_data_source.resource: Read complete after 0s [id=static]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elasticache_serverless_cache.named_test_resource will be created
  + resource "aws_elasticache_serverless_cache" "named_test_resource" {
      + arn                      = (known after apply)
      + create_time              = (known after apply)
      + daily_snapshot_time      = (known after apply)
      + description              = (known after apply)
      + endpoint                 = (known after apply)
      + engine                   = "valkey"
      + full_engine_version      = (known after apply)
      + id                       = (known after apply)
      + major_engine_version     = (known after apply)
      + name                     = "turbottest12017"
      + reader_endpoint          = (known after apply)
      + region                   = "us-east-1"
      + security_group_ids       = [
          + (known after apply),
        ]
      + snapshot_retention_limit = (known after apply)
      + status                   = (known after apply)
      + subnet_ids               = [
          + (known after apply),
          + (known after apply),
        ]
      + tags                     = {
          + "name" = "turbottest12017"
        }
      + tags_all                 = {
          + "name" = "turbottest12017"
        }
      + user_group_id            = "turbottest12017"

      + cache_usage_limits {
          + data_storage {
              + maximum = 10
              + unit    = "GB"
            }
          + ecpu_per_second {
              + maximum = 5000
            }
        }
    }

  # aws_elasticache_user_group.my_user_group will be created
  + resource "aws_elasticache_user_group" "my_user_group" {
      + arn           = (known after apply)
      + engine        = "valkey"
      + id            = (known after apply)
      + region        = "us-east-1"
      + tags_all      = (known after apply)
      + user_group_id = "turbottest12017"
    }

  # aws_security_group.my_security_group will be created
  + resource "aws_security_group" "my_security_group" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "turbottest12017"
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.my_subnet will be created
  + resource "aws_subnet" "my_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.my_subnet_2 will be created
  + resource "aws_subnet" "my_subnet_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.my_vpc will be created
  + resource "aws_vpc" "my_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-1"
      + tags_all                             = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + account_id            = "EDITED"
  + resource_aka          = "arn:aws:elasticache:us-east-1:EDITED:serverlesscache:turbottest12017"
  + resource_id           = "turbottest12017"
  + resource_name         = "turbottest12017"
  + serverless_cache_name = "turbottest12017"
aws_elasticache_user_group.my_user_group: Creating...
aws_vpc.my_vpc: Creating...
aws_vpc.my_vpc: Creation complete after 2s [id=vpc-0a86f6a7af5835488]
aws_subnet.my_subnet_2: Creating...
aws_subnet.my_subnet: Creating...
aws_security_group.my_security_group: Creating...
aws_subnet.my_subnet_2: Creation complete after 2s [id=subnet-058b3785107a70b81]
aws_subnet.my_subnet: Creation complete after 2s [id=subnet-0377d98368caf757e]
aws_security_group.my_security_group: Creation complete after 4s [id=sg-0514ed3d1b6a22324]
aws_elasticache_user_group.my_user_group: Still creating... [10s elapsed]
aws_elasticache_user_group.my_user_group: Still creating... [20s elapsed]
aws_elasticache_user_group.my_user_group: Still creating... [30s elapsed]
aws_elasticache_user_group.my_user_group: Creation complete after 31s [id=turbottest12017]
aws_elasticache_serverless_cache.named_test_resource: Creating...
aws_elasticache_serverless_cache.named_test_resource: Still creating... [10s elapsed]
aws_elasticache_serverless_cache.named_test_resource: Still creating... [20s elapsed]
aws_elasticache_serverless_cache.named_test_resource: Still creating... [30s elapsed]
aws_elasticache_serverless_cache.named_test_resource: Still creating... [40s elapsed]
aws_elasticache_serverless_cache.named_test_resource: Still creating... [50s elapsed]
aws_elasticache_serverless_cache.named_test_resource: Still creating... [1m0s elapsed]
aws_elasticache_serverless_cache.named_test_resource: Still creating... [1m10s elapsed]
aws_elasticache_serverless_cache.named_test_resource: Still creating... [1m20s elapsed]
aws_elasticache_serverless_cache.named_test_resource: Still creating... [1m30s elapsed]
aws_elasticache_serverless_cache.named_test_resource: Still creating... [1m40s elapsed]
aws_elasticache_serverless_cache.named_test_resource: Still creating... [1m50s elapsed]
aws_elasticache_serverless_cache.named_test_resource: Creation complete after 1m53s [id=turbottest12017]

Warning: Deprecated

  with data.null_data_source.resource,
  on variables.tf line 43, in data "null_data_source" "resource":
  43: data "null_data_source" "resource" {

The null_data_source was historically used to construct intermediate values
to re-use elsewhere in configuration, the same can now be achieved using
locals or the terraform_data resource type in Terraform 1.4 and later.

(and one more similar warning elsewhere)

Warning: Deprecated attribute

  on variables.tf line 117, in output "resource_aka":
 117:   value      = "arn:${data.aws_partition.current.partition}:elasticache:${data.aws_region.primary.name}:${data.aws_caller_identity.current.account_id}:serverlesscache:${aws_elasticache_serverless_cache.named_test_resource.name}"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and one more similar warning elsewhere)

Apply complete! Resources: 6 added, 0 changed, 0 destroyed.

Outputs:

account_id = "EDITED"
resource_aka = "arn:aws:elasticache:us-east-1:EDITED:serverlesscache:turbottest12017"
resource_id = "turbottest12017"
resource_name = "turbottest12017"
serverless_cache_name = "turbottest12017"

Running SQL query: test-get-query.sql
[
  {
    "cache_usage_limits": {
      "DataStorage": {
        "Maximum": 10,
        "Minimum": null,
        "Unit": "GB"
      },
      "ECPUPerSecond": {
        "Maximum": 5000,
        "Minimum": null
      }
    },
    "engine": "valkey",
    "serverless_cache_name": "turbottest12017",
    "tags_src": [
      {
        "Key": "name",
        "Value": "turbottest12017"
      }
    ]
  }
]
✔ PASSED

Running SQL query: test-hydrate-query.sql
[
  {
    "akas": [
      "arn:aws:elasticache:us-east-1:EDITED:serverlesscache:turbottest12017"
    ],
    "serverless_cache_name": "turbottest12017",
    "tags": {
      "name": "turbottest12017"
    },
    "title": "turbottest12017"
  }
]
✔ PASSED

Running SQL query: test-list-query.sql
[
  {
    "akas": [
      "arn:aws:elasticache:us-east-1:EDITED:serverlesscache:turbottest12017"
    ],
    "engine": "valkey",
    "serverless_cache_name": "turbottest12017",
    "title": "turbottest12017"
  }
]
✔ PASSED

Running SQL query: test-notfound-query.sql
[]
✔ PASSED

POSTTEST: tests/aws_elasticache_serverless_cache

TEARDOWN: tests/aws_elasticache_serverless_cache

SUMMARY:

1/1 passed.
```
</details>